; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v1 - type_3 ?v6 - type_1)
 	      (pred_4 ?v3 - object ?v6 - type_1)
	      (pred_2 ?v1 - type_3 ?v5 - type_2)
	      (pred_1 ?v1 - type_3 ?v3 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v4 ?v2 - type_1)
       :precondition (and  (pred_3 ?v1 ?v4))
       :effect (and  (pred_3 ?v1 ?v2)
		     (not (pred_3 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_3 ?v8 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v7) (pred_3 ?v1 ?v7) (pred_2 ?v1 ?v5))
       :effect (and (pred_1 ?v1 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v7)) 
		    (not (pred_2 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_3 ?v8 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v8 ?v5) (pred_3 ?v1 ?v7))
       :effect (and (pred_4 ?v8 ?v7)
		    (pred_2 ?v1 ?v5)
		    (not (pred_1 ?v1 ?v8 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_3
obj_02 obj_04 - type_2
obj_07 obj_03 obj_05 - type_1
obj_01 obj_08 obj_06 - object)
(:init
(pred_3 obj_09 obj_03)
(pred_2 obj_09 obj_02)
(pred_2 obj_09 obj_04)
(pred_4 obj_01 obj_03)
(pred_4 obj_08 obj_05)
(pred_4 obj_06 obj_05)
)
(:goal
(and
(pred_4 obj_01 obj_07)
(pred_4 obj_08 obj_05)
(pred_4 obj_06 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_09 ?b obj_04))))
)
)

; plan
1. (op_1 obj_09 obj_01 obj_03 obj_02)
   deleted: (pred_4 obj_01 obj_03) (pred_2 obj_09 obj_02)
   added: (pred_1 obj_09 obj_01 obj_02)
   goals met: 1 of 3
2. (op_3 obj_09 obj_03 obj_07)
   deleted: (pred_3 obj_09 obj_03)
   added: (pred_3 obj_09 obj_07)
   goals met: 1 of 3
3. (op_2 obj_09 obj_01 obj_07 obj_02)
   deleted: (pred_1 obj_09 obj_01 obj_02)
   added: (pred_4 obj_01 obj_07) (pred_2 obj_09 obj_02)
   goals met: 2 of 3
4. (op_3 obj_09 obj_07 obj_05)
   deleted: (pred_3 obj_09 obj_07)
   added: (pred_3 obj_09 obj_05)
   goals met: 2 of 3
5. (op_1 obj_09 obj_06 obj_05 obj_02)
   deleted: (pred_4 obj_06 obj_05) (pred_2 obj_09 obj_02)
   added: (pred_1 obj_09 obj_06 obj_02)
   goals met: 2 of 3
6. (op_3 obj_09 obj_05 obj_03)
   deleted: (pred_3 obj_09 obj_05)
   added: (pred_3 obj_09 obj_03)
   goals met: 2 of 3
7. (op_2 obj_09 obj_06 obj_03 obj_02)
   deleted: (pred_1 obj_09 obj_06 obj_02)
   added: (pred_4 obj_06 obj_03) (pred_2 obj_09 obj_02)
   goals met: 3 of 3
